在Jupyter Notebook中使用SQL，参考文档https://github.com/catherinedevlin/ipython-sql  
需要检查是否安装ipython-sql和PyMySQL：conda list，安装命令：pip install ipython-sql和pip install pymysql

In [2]:
import pandas as pd
# 打印DataFrame设置
# 显示所有列
pd.set_option('display.max_columns',None)
# 显示所有列
pd.set_option('display.max_rows',None)
# 设置value显示长度，默认为50
pd.set_option('max_colwidth',100)

In [3]:
# 载入
%load_ext sql

注意，下面这一步连接mysql可能会报错(pymysql.err.InternalError) (1193, "Unknown system variable 'tx_isolation'")。老版本mysql使用的是tx_isolation，而mysql 8.0使用的是transaction_isolation。解决方法是更新SQLAlchemy-1.1.13：pip install --upgrade SQLAlchemy。（注意，安装升级SQLAlchemy-1.3.5后Restart & Clear Output）

In [4]:
# 连接mysql数据库 用户名root 密码root123 本地数据库localhost 数据库名school
%sql mysql+pymysql://root:root123@localhost/mysql?charset=utf8
%sql mysql+pymysql://root:root123@localhost/school?charset=utf8

C:\ProgramData\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

'Connected: root@school'

###### 如果SQL语句比较简单就使用一个百分号%写成一行；如果SQL语句比较复杂就用两个百分号写成多行，此时SQL语句最好单独一个Cell，并且不能在这个Cell中加注释。

In [5]:
%%sql
SELECT * 
FROM heros 
limit 2
;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
(pymysql.err.ProgrammingError) (1146, "Table 'school.heros' doesn't exist")
[SQL: SELECT *
FROM heros
limit 2
;]
(Background on this error at: http://sqlalche.me/e/f405)

In [6]:
%%sql
res10 <<
SELECT * FROM score limit 2;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
2 rows affected.
Returning data to local variable res10

In [7]:
df1=res10.DataFrame()
df1.head()

     学号   课程号    成绩 tags
0  0001  0001  80.0  1,2
1  0001  0002  90.0  1,2

In [8]:
# SQL语句写成一行的情况
res = %sql SELECT * FROM score limit 2; 
df2 = res.DataFrame()
df2.head()

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
2 rows affected.

     学号   课程号    成绩 tags
0  0001  0001  80.0  1,2
1  0001  0002  90.0  1,2

In [9]:
%%sql
res20 <<
show tables;
# 显示当前连接的数据库下所有表名

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
8 rows affected.
Returning data to local variable res20

In [10]:
print(res20)

+------------------+
| Tables_in_school |
+------------------+
|   count_as_sex   |
|      course      |
|     course1      |
|      score       |
|      score1      |
|      score2      |
|     student      |
|     teacher      |
+------------------+

## 实现分组排序ROW_NUMBER()、RANK()、DENSE_RANK()和开窗函数OVER()。适用于MySQL 8.0

#### 最好将SQL语句单独放在一个Cell，下面这种就不太好。

In [11]:
%%sql
SELECT * FROM
    (SELECT *, RANK() OVER(PARTITION BY 课程号 ORDER BY '成绩' DESC) AS `rank`
    FROM score) as t1
WHERE t1.rank=1
;
# 使用rank() over() 进行排序得到一张新表，然后根据新表筛选排序结果。
# 但是最好不要在这里加注释，虽然不知道为什么，因为结果打印不出来。

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
11 rows affected.
0 rows affected.

[]

#### 如果SQL语句单独写作一行也可以加注释，但是SQL语句可读性差。

In [12]:
%sql SELECT * FROM (SELECT *, RANK() OVER(PARTITION BY `课程号` ORDER BY `成绩` DESC) AS `rank` FROM score) AS t1 WHERE t1.rank IN (1,2,3);

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
9 rows affected.

[('0001', '0001', 80.0, '1,2', 1),
 ('0003', '0001', 80.0, '5,7,8', 1),
 ('0006', '0001', 80.0, '1', 1),
 ('0001', '0002', 90.0, '1,2', 1),
 ('0003', '0002', 80.0, '5,7,8', 2),
 ('0005', '0002', 70.0, '4,5,6,7,8', 3),
 ('0001', '0003', 99.0, '1,2', 1),
 ('0002', '0003', 80.0, '2,3', 2),
 ('0003', '0003', 80.0, '5,7,8', 2)]

#### 使用RANK()和OVER实现排序：113446

In [13]:
%%sql
SELECT * FROM
    (SELECT *, RANK()  OVER(PARTITION BY 课程号 ORDER BY 成绩 DESC) AS `rank`
    FROM score) as t1
WHERE t1.rank IN (1,2,3)
;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
9 rows affected.

[('0001', '0001', 80.0, '1,2', 1),
 ('0003', '0001', 80.0, '5,7,8', 1),
 ('0006', '0001', 80.0, '1', 1),
 ('0001', '0002', 90.0, '1,2', 1),
 ('0003', '0002', 80.0, '5,7,8', 2),
 ('0005', '0002', 70.0, '4,5,6,7,8', 3),
 ('0001', '0003', 99.0, '1,2', 1),
 ('0002', '0003', 80.0, '2,3', 2),
 ('0003', '0003', 80.0, '5,7,8', 2)]

#### 使用DENSE_RANK()和OVER实现排序：112334

In [14]:
%%sql
SELECT * FROM
    (SELECT *, DENSE_RANK() OVER(PARTITION BY `课程号` ORDER BY `成绩` DESC) AS `rank`
    FROM score) AS t1
WHERE t1.rank IN (1,2,3)
;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
10 rows affected.

[('0001', '0001', 80.0, '1,2', 1),
 ('0003', '0001', 80.0, '5,7,8', 1),
 ('0006', '0001', 80.0, '1', 1),
 ('0005', '0001', 60.0, '4,5,6,7,8', 2),
 ('0001', '0002', 90.0, '1,2', 1),
 ('0003', '0002', 80.0, '5,7,8', 2),
 ('0005', '0002', 70.0, '4,5,6,7,8', 3),
 ('0001', '0003', 99.0, '1,2', 1),
 ('0002', '0003', 80.0, '2,3', 2),
 ('0003', '0003', 80.0, '5,7,8', 2)]

#### 使用ROW_NUMBER()和OVER实现排序：12345

In [15]:
%%sql
SELECT * FROM
    (SELECT *, ROW_NUMBER()  OVER(PARTITION BY `课程号` ORDER BY `成绩` DESC) AS `rank`
    FROM score) AS t1
WHERE t1.rank IN (1,2,3)
;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
9 rows affected.

[('0001', '0001', 80.0, '1,2', 1),
 ('0003', '0001', 80.0, '5,7,8', 2),
 ('0006', '0001', 80.0, '1', 3),
 ('0001', '0002', 90.0, '1,2', 1),
 ('0003', '0002', 80.0, '5,7,8', 2),
 ('0005', '0002', 70.0, '4,5,6,7,8', 3),
 ('0001', '0003', 99.0, '1,2', 1),
 ('0002', '0003', 80.0, '2,3', 2),
 ('0003', '0003', 80.0, '5,7,8', 3)]

#### 注意分组排序采用 row_number、rank()、dense_rank()和开窗函数over()  注意row_number()得到排序是12345  rank()得到排序是11345  dense_rank()得到排序是1123345
https://zhuanlan.zhihu.com/p/66777046

## 实现列分割
如下，每个用户有多个标签，标签之间以逗号隔开。目标是统计每个标签的用户数，谁拥有的标签最多，哪个标签拥有用户最多？

In [16]:
%%sql
SELECT `学号`,`tags` FROM score;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
11 rows affected.

[('0001', '1,2'),
 ('0001', '1,2'),
 ('0001', '1,2'),
 ('0002', '2,3'),
 ('0002', '2,3'),
 ('0003', '5,7,8'),
 ('0003', '5,7,8'),
 ('0003', '5,7,8'),
 ('0005', '4,5,6,7,8'),
 ('0005', '4,5,6,7,8'),
 ('0006', '1')]

需要利用MySQL内置表help_topic表的help_topic_id。根据标签数分配help_topic_id。

In [17]:
%%sql
SELECT help_topic_id from mysql.help_topic LIMIT 5;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
5 rows affected.

[(0,), (1,), (2,), (3,), (4,)]

In [18]:
%%sql
SELECT score.`学号`,score.`tags`,help_topic.`help_topic_id` FROM school.score 
INNER JOIN mysql.help_topic
ON help_topic_id < (LENGTH(score.tags)-LENGTH(REPLACE(score.tags,',',''))+1)
GROUP BY 1,2,3;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
13 rows affected.

[('0001', '1,2', 0),
 ('0001', '1,2', 1),
 ('0002', '2,3', 0),
 ('0002', '2,3', 1),
 ('0003', '5,7,8', 0),
 ('0003', '5,7,8', 1),
 ('0003', '5,7,8', 2),
 ('0005', '4,5,6,7,8', 0),
 ('0005', '4,5,6,7,8', 1),
 ('0005', '4,5,6,7,8', 2),
 ('0005', '4,5,6,7,8', 3),
 ('0005', '4,5,6,7,8', 4),
 ('0006', '1', 0)]

上一步加GROUP BY的作用是因为这个数据比较特殊，用户ID不是唯一的。  
下一步很明显，就是将tags，使用SUBSTRING_INDEX()结合help_topic_id进行分割选取：SUBSTRING_INDEX(SUBSTRING_INDEX(tags,',',help_topic_id+1),',',-1)

In [19]:
%%sql
SELECT score.`学号`,score.`tags`,SUBSTRING_INDEX(SUBSTRING_INDEX(score.`tags`,',',help_topic_id+1),',',-1) AS tag FROM school.score 
INNER JOIN mysql.help_topic
ON help_topic_id < (LENGTH(score.tags)-LENGTH(REPLACE(score.tags,',',''))+1)
GROUP BY 1,2,3;

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
13 rows affected.

[('0001', '1,2', '1'),
 ('0001', '1,2', '2'),
 ('0002', '2,3', '2'),
 ('0002', '2,3', '3'),
 ('0003', '5,7,8', '5'),
 ('0003', '5,7,8', '7'),
 ('0003', '5,7,8', '8'),
 ('0005', '4,5,6,7,8', '4'),
 ('0005', '4,5,6,7,8', '5'),
 ('0005', '4,5,6,7,8', '6'),
 ('0005', '4,5,6,7,8', '7'),
 ('0005', '4,5,6,7,8', '8'),
 ('0006', '1', '1')]

## 以下测试各种内置函数

In [20]:
%%sql
SELECT CURRENT_DATE(),NOW(),CURRENT_TIME(),CURRENT_TIMESTAMP(),DATE('2019-07-07'),TO_DAYS('2019-12-12'),EXTRACT(YEAR FROM '2019-12-12');

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[(datetime.date(2019, 7, 7), datetime.datetime(2019, 7, 7, 21, 15, 55), datetime.timedelta(0, 76555), datetime.datetime(2019, 7, 7, 21, 15, 55), datetime.date(2019, 7, 7), 737770, 2019)]

In [21]:
%%sql
SELECT ABS(-10),MOD(5,2),ROUND(1163.267,2),ROUND(1163.267,-2)

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[(10, 1, Decimal('1163.27'), Decimal('1200'))]

In [22]:
%%sql
SELECT CONCAT('abc',123),LENGTH('你好！'),CHAR_LENGTH('你好！'),REPLACE('hexxo','x','l'),SUBSTRING('hello world',1,7);

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[('abc123', 9, 3, 'hello', 'hello w')]

In [23]:
%%sql
SELECT SUBSTRING_INDEX('blog.jb51.net','.',1), SUBSTRING_INDEX('blog.jb51.net','.',-1)

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[('blog', 'net')]

In [31]:
%%sql
SELECT CAST('2019' AS signed)

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[(2019,)]

In [28]:
%%sql
SELECT COALESCE(NULL,12,23)

   mysql+pymysql://root:***@localhost/mysql?charset=utf8
 * mysql+pymysql://root:***@localhost/school?charset=utf8
1 rows affected.

[(12,)]